---
kind: type
id: T:Autodesk.Revit.DB.LinePatternSegmentType
source: html/19143fde-b4c9-c466-557d-42a03bc289e5.htm
---
# Autodesk.Revit.DB.LinePatternSegmentType

Represents the type of a line pattern segment.

## Syntax (C#)
```csharp
public enum LinePatternSegmentType
```